//JCLARQVA JOB (BATCH),MSGCLASS=H,MSGLEVEL=(1,1),REGION=5M,
//            NOTIFY=&SYSUID
//JOBLIB   DD DSN=AD.BRQ.BATCH.LOADLIB,DISP=SHR
//*
//STEP01   EXEC PGM=CBONREAD
//*
//ARQSAI   DD DSN=M173811.TESTE.SLRECL20,
//       DISP=(OLD,CATLG,DELETE),
//       SPACE=(TRK,(00200,4000),RLSE),
//       DCB=(LRECL=020,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//* 
